buscador_test.yaml
config:
  plugins:
      metrics-by-endpoint:
        useOnlyRequestNames: true
  target: "https://www.zonaprop.com.ar/emprendimientos"
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'warm up'
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: 'hot sale'
  variables:
    clientId: "40130544"
    portal: "https://www.zonaprop.com.ar"
    city: ["1001982", "1001982", "1002000"]
  ensure:
    p99: 1300
scenarios:
  - name: "Listado de emprendimientos con ubicaciones"
    flow: 
      - loop:
        - post:
            url: "{{ portal }}/rplis-api/postings"
            json:
              q: ""
              pagina: 2
              sort: "relevance"
              tipoDeOperacion: "desarrollosURL"
              city: "{{ $loopElement }}"
            expect: 
              - statusCode: 200
            capture:
              - json: $.totalPosting
                as: postingPorUbicacion
        over:
          - 1001982
          - 1004697